{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim",
      "version": "'v0.8.0'"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session",
      "version": "'pre-nvim-0.10'"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'v1.10.2'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'v2.1.0'"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "lf.nvim": {
      "src": "https://github.com/graknow/lf.nvim",
      "version": "'master'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markview.nvim": {
      "src": "https://github.com/OXY2DEV/markview.nvim",
      "version": "'v28.1.0'"
    },
    "neovim": {
      "src": "https://github.com/rose-pine/neovim",
      "version": "'v3.0.2'"
    },
    "nvim-luaref": {
      "src": "https://github.com/emiasims/nvim-luaref"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'v0.1.4'"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'v0.2.2'"
    },
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim",
      "version": "'v2.13.1'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'v3.17.0'"
    }
  }
}
